; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v6 ?v2)
             (pred_12 ?v10 ?v1)
             (pred_8 ?v6 ?v1)
             (pred_1 ?v8 ?v6 )
	     (pred_10 ?v6)
             (pred_3 ?v12)
             (pred_9 ?v10)
             (pred_4 ?v1)
             (pred_7 ?v6)
             (pred_11 ?v10)
             (pred_5 ?v6)
             (pred_2 ))



(:action op_4
:parameters (?v7 ?v11 ?v3 ?v9)
:precondition (and (pred_3 ?v7) (pred_3 ?v11) (pred_9 ?v3) (pred_4 ?v9)
          (pred_6 ?v7 ?v11) (pred_12 ?v3 ?v9)
                   (pred_8 ?v11 ?v9) (pred_10 ?v7) 
                   (pred_7 ?v11) (pred_11 ?v3))
:effect (and  (pred_5 ?v11) (not (pred_7 ?v11))))


(:action op_1
:parameters (?v7 ?v4)
:precondition (and (pred_3 ?v7) (pred_3 ?v4)
               (pred_10 ?v7) (pred_6 ?v7 ?v4) (pred_5 ?v4))
:effect (and (pred_10 ?v4) (not (pred_10 ?v7))))

(:action op_5
:parameters (?v7 ?v3)
:precondition (and (pred_3 ?v7) (pred_9 ?v3) 
                  (pred_10 ?v7) (pred_1 ?v3 ?v7) (pred_2 ))
:effect (and (pred_11 ?v3)
   (not (pred_1 ?v3 ?v7)) (not (pred_2 ))))


(:action op_2
:parameters (?v7 ?v13 ?v5)
:precondition (and (pred_3 ?v7) (pred_9 ?v13) (pred_9 ?v5)
                  (pred_10 ?v7) (pred_11 ?v5) (pred_1 ?v13 ?v7))
:effect (and (pred_11 ?v13) (pred_1 ?v5 ?v7)
        (not (pred_11 ?v5)) (not (pred_1 ?v13 ?v7))))

(:action op_3
:parameters (?v7 ?v3)
:precondition (and (pred_3 ?v7) (pred_9 ?v3) 
                  (pred_10 ?v7) (pred_11 ?v3))
:effect (and (pred_2 ) (pred_1 ?v3 ?v7) (not (pred_11 ?v3)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_12 obj_20 obj_03 obj_01 obj_17 obj_05 obj_08 obj_06 obj_19 obj_09 obj_14 obj_02 obj_18 obj_15 obj_11 obj_16
    obj_10 obj_04
    obj_21 obj_07 obj_13
    )

    (:init
       (pred_2)

       (pred_3 obj_12)
       (pred_3 obj_20)
       (pred_3 obj_03)
       (pred_3 obj_01)
       (pred_3 obj_17)
       (pred_3 obj_05)
       (pred_3 obj_08)
       (pred_3 obj_06)
       (pred_3 obj_19)
       (pred_3 obj_09)
       (pred_3 obj_14)
       (pred_3 obj_02)
       (pred_3 obj_18)
       (pred_3 obj_15)
       (pred_3 obj_11)
       (pred_3 obj_16)
       (pred_4 obj_10)
       (pred_4 obj_04)
       (pred_9 obj_21)
       (pred_9 obj_07)
       (pred_9 obj_13)

       (pred_6 obj_12 obj_17)
       (pred_6 obj_12 obj_20)
       (pred_6 obj_20 obj_05)
       (pred_6 obj_20 obj_03)
       (pred_6 obj_20 obj_12)
       (pred_6 obj_03 obj_08)
       (pred_6 obj_03 obj_01)
       (pred_6 obj_03 obj_20)
       (pred_6 obj_01 obj_06)
       (pred_6 obj_01 obj_03)
       (pred_6 obj_17 obj_19)
       (pred_6 obj_17 obj_05)
       (pred_6 obj_17 obj_12)
       (pred_6 obj_05 obj_09)
       (pred_6 obj_05 obj_08)
       (pred_6 obj_05 obj_20)
       (pred_6 obj_05 obj_17)
       (pred_6 obj_08 obj_14)
       (pred_6 obj_08 obj_06)
       (pred_6 obj_08 obj_03)
       (pred_6 obj_08 obj_05)
       (pred_6 obj_06 obj_02)
       (pred_6 obj_06 obj_01)
       (pred_6 obj_06 obj_08)
       (pred_6 obj_19 obj_18)
       (pred_6 obj_19 obj_09)
       (pred_6 obj_19 obj_17)
       (pred_6 obj_09 obj_15)
       (pred_6 obj_09 obj_14)
       (pred_6 obj_09 obj_05)
       (pred_6 obj_09 obj_19)
       (pred_6 obj_14 obj_11)
       (pred_6 obj_14 obj_02)
       (pred_6 obj_14 obj_08)
       (pred_6 obj_14 obj_09)
       (pred_6 obj_02 obj_16)
       (pred_6 obj_02 obj_06)
       (pred_6 obj_02 obj_14)
       (pred_6 obj_18 obj_15)
       (pred_6 obj_18 obj_19)
       (pred_6 obj_15 obj_11)
       (pred_6 obj_15 obj_09)
       (pred_6 obj_15 obj_18)
       (pred_6 obj_11 obj_16)
       (pred_6 obj_11 obj_14)
       (pred_6 obj_11 obj_15)
       (pred_6 obj_16 obj_02)
       (pred_6 obj_16 obj_11)
       (pred_7 obj_18)
       (pred_7 obj_17)
       (pred_7 obj_05)
       (pred_8  obj_18 obj_10)
       (pred_8  obj_17 obj_04)
       (pred_8  obj_05 obj_04)
       (pred_5 obj_12)
       (pred_5 obj_20)
       (pred_5 obj_03)
       (pred_5 obj_01)
       (pred_5 obj_08)
       (pred_5 obj_06)
       (pred_5 obj_19)
       (pred_5 obj_09)
       (pred_5 obj_14)
       (pred_5 obj_02)
       (pred_5 obj_15)
       (pred_5 obj_11)
       (pred_5 obj_16)

       (pred_12  obj_21 obj_10)
       (pred_12  obj_07 obj_04)
       (pred_12  obj_13 obj_04)
       (pred_1 obj_21 obj_16)
       (pred_1 obj_07 obj_19)
       (pred_1 obj_13 obj_03)
       (pred_10 obj_19)
    )

    (:goal (and
       (pred_1 obj_21 obj_18)
       (pred_1 obj_07 obj_11)
       (pred_1 obj_13 obj_11)
    ))
(:constraints
  (always (not (pred_10 obj_14)))
)
)

; plan
1. (op_5 obj_19 obj_07)
   deleted: (pred_1 obj_07 obj_19) (pred_2)
   added: (pred_11 obj_07)
   goals met: 0 of 3
2. (op_1 obj_19 obj_09)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_09)
   goals met: 0 of 3
3. (op_1 obj_09 obj_15)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_15)
   goals met: 0 of 3
4. (op_1 obj_15 obj_11)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_11)
   goals met: 0 of 3
5. (op_3 obj_11 obj_07)
   deleted: (pred_11 obj_07)
   added: (pred_2) (pred_1 obj_07 obj_11)
   goals met: 1 of 3
6. (op_1 obj_11 obj_16)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_16)
   goals met: 1 of 3
7. (op_5 obj_16 obj_21)
   deleted: (pred_1 obj_21 obj_16) (pred_2)
   added: (pred_11 obj_21)
   goals met: 1 of 3
8. (op_1 obj_16 obj_11)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_11)
   goals met: 1 of 3
9. (op_1 obj_11 obj_15)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_15)
   goals met: 1 of 3
10. (op_4 obj_15 obj_18 obj_21 obj_10)
   deleted: (pred_7 obj_18)
   added: (pred_5 obj_18)
   goals met: 1 of 3
11. (op_1 obj_15 obj_18)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_18)
   goals met: 1 of 3
12. (op_3 obj_18 obj_21)
   deleted: (pred_11 obj_21)
   added: (pred_2) (pred_1 obj_21 obj_18)
   goals met: 2 of 3
13. (op_1 obj_18 obj_15)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_15)
   goals met: 2 of 3
14. (op_1 obj_15 obj_11)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_11)
   goals met: 2 of 3
15. (op_1 obj_11 obj_16)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_16)
   goals met: 2 of 3
16. (op_1 obj_16 obj_02)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_02)
   goals met: 2 of 3
17. (op_1 obj_02 obj_06)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_06)
   goals met: 2 of 3
18. (op_1 obj_06 obj_08)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_08)
   goals met: 2 of 3
19. (op_1 obj_08 obj_03)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_03)
   goals met: 2 of 3
20. (op_5 obj_03 obj_13)
   deleted: (pred_1 obj_13 obj_03) (pred_2)
   added: (pred_11 obj_13)
   goals met: 2 of 3
21. (op_1 obj_03 obj_08)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_08)
   goals met: 2 of 3
22. (op_1 obj_08 obj_06)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_06)
   goals met: 2 of 3
23. (op_1 obj_06 obj_02)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_02)
   goals met: 2 of 3
24. (op_1 obj_02 obj_16)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_16)
   goals met: 2 of 3
25. (op_1 obj_16 obj_11)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_11)
   goals met: 2 of 3
26. (op_3 obj_11 obj_13)
   deleted: (pred_11 obj_13)
   added: (pred_2) (pred_1 obj_13 obj_11)
   goals met: 3 of 3
